---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.WallSpaceSeparationOverlap
source: html/a2eae757-96d3-9d1c-044c-439ddfb19bdd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.WallSpaceSeparationOverlap Property

A wall and a space separation line overlap. One of them may be ignored when Revit finds space boundaries.
 Shorten or delete the space separation line to remove the overlap.

## Syntax (C#)
```csharp
public static FailureDefinitionId WallSpaceSeparationOverlap { get; }
```